Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: ' references is also helpful.
zh_cn: ' 参考也十分有用。

source: (2010) proposed a model for computational thinking across the curriculum.
zh_cn: (2010) 提出了一个贯穿所有课程的计算机思维模型。

source: (Andersen & Batova, 2015, p.
zh_cn: （安德森和巴特瓦，2015年，第

source: (Hackos, 2016, p.
zh_cn: （哈克斯，2016 年，第

source: (Horn et al., 1969, p.
zh_cn: （霍恩等，1969年，第

source: (Kaplan, 2014)
zh_cn: （卡普兰， 2014年）

source: (LimitedDitaProfile, 2011)
zh_cn: （限定版 DITA 标准概要，2011年）

source: (Mathewson, 2016)
zh_cn: （马修森， 2016年）

source: (O'Keefe, 2009, p.
zh_cn: （奥基夫，2009年，第

source: (Priestley, 2012a)
zh_cn: （普里斯特利，2012年）

source: (Priestley, 2012)
zh_cn: （普里斯特利，2012年）

source: (Priestley, quoted in Etheridge, 2016)
zh_cn: （普里斯特利，引自埃瑟里奇，2016年）

source: (The Information Mapping® Method, n.d.)
zh_cn: （信息映射® 方法，未注明日期）

source: (“the true structured text format”)2 or setext (Structure Enhanced Text)3 heading.
zh_cn: （“真正的结构化文本格式”）2格式，也可以使用 setext （增强结构文本格式）3 格式来表示。

source: 334)” represent those broader rhetorical strategies, and are as follows:
zh_cn: 引入组件内容管理、结构化创作和 DITA 写作的概念” (Evia et al., 2015, p.334)，这句话代表着上文提到的更广泛的修辞策略，具体情况如下所示：

source: 358) In the world of scientific and technical communication, DITA and struc- tured authoring are not alone in using concepts of evolution to describe genre change.
zh_cn: 在科技和技术传播的世界里，DITA 和结构化创作并不是唯一使用进化概念来描述体裁变化的。

source: 40 years later, The Method has been embraced by hundreds of thousands of individuals in 40 countries, standing the test of time and technological evolution.
zh_cn: 40年后，这种方法已经被40个国家的数十万人接受，经受住了时间和技术发展的考验。

source: <alt> contains text.
zh_cn: <alt> 包含文本

source: <body> contains <section>
zh_cn: <body> 包含 <section>

source: <image> contains <alt> (alternate text)
zh_cn: <image> 包含 <alt> （替代文本）

source: <li> contains <p>
zh_cn: <li> 包含 <p>

source: <map> contains <title>, <topicref> (topic hyper-reference)
zh_cn: <map> 包含 <title>、<topicref> （话题超链接）

source: <navtitle> contains <ph> or text.
zh_cn: <navtitle> 包含 <ph> 或文本

source: <p> contains <ph>, <xref> (cross reference), or text
zh_cn: <p> 包含 <ph>、<xref> （交叉引用）和文本

source: <ph> contains <ph> or text
zh_cn: <ph> 包含 <ph> 和文本

source: <prereq> with a list of the ingredients needed for the recipe
zh_cn: < preeq > 是菜谱所需的配料列表

source: <prolog> with some information about the recipe's author and category
zh_cn: <prolog> 是关于菜谱作者和类别的一些信息

source: <section> contains <p> (paragraph), <ul> (unordered list), <ol> (ordered list), <simpletable>, <image>
zh_cn: <section> 包含 <p> （段落）、<ul> （无序列表）、<ol> （有序列表）<simpletable> 和 <image>

source: <shortdesc> contains <ph> (phrase) or text (directly written inside the tags)
zh_cn: <shortdesc> 包含 <ph> （短语）或文本（直接写在标签之内）

source: <shortdesc> with a summary of the topic's contents
zh_cn: <shortdesc> 是题内容的摘要

source: <simpletable> contains 1 <sthead> (simple table header; optional), <strow> (simple table row)
zh_cn: <simpletable> 包含 1个<sthead> （简单的可选表头）和<strow> （简单的表行）

source: <stentry> contains <p>, <ul>, <ol>
zh_cn: <stentry> 包含 <p>、<ul>和<ol>

source: <steps> with a collection of individual <step> elements containing a command (<cmd>) with an action verb.
zh_cn: <steps> 包含一系列独立的 <step> 元素，每个 <step> 元素都包含一个带有动词的命令（<cmd>）

source: <sthead>/<strow> contain <stentry> (simple table entry or data)
zh_cn: <sthead>或<strow> 包含 <stentry> （简单的表条目或数据）

source: Creating Intelligent Content with Lightweight DITA shows structured authoring in practice without the need for sophisticated software tools.
zh_cn: 在实践中展现了结构化创作，无需复杂的软件工具。

source: Figure 6.4 reproduces the essential topic with a placeholder comment for content.
zh_cn: 图6.4展示了一个重新生成的基础话题，并用注释为内容占位。

source: Figure 6.12 shows the introductory topic with a short description paragraph in HDITA.
zh_cn: 图6.12展示了 HDITA 基础组件中用于简短描述的段落。

source: 2012, p.
zh_cn: 2012年，第

source: As I write this, I am a member of the CHCI executive committee and chair of its education-oriented strategic planning group.
zh_cn: 我著书时，是CHCI执行委员会成员，并且担任了技术导向战略计划团体的主席。

source: Day explained that, when naming the standard, DITA “represented a great deal of messaging in a compact and memorable acronym:”
zh_cn: 戴解释说，在命名该标准时，是想用DITA“这个简洁易记的缩写词传递大量信息”：

source: Figure 5.7 shows a screen capture of the navigation menu for the marinara sauce recipe critique website without custom formatting.
zh_cn: 图5.7展示了没有自定义格式的意式番茄罗勒酱菜谱评论网站导航菜单的屏幕截图。

source: The CommonMark initiative, which aims to propose a Markdown standard, adds that it is a “plain text format for writing structured documents, based on formatting conventions from email and usenet” (CommonMark, n.d.).
zh_cn: CommonMark 倡议旨在提出一种 Markdown 标准，并补充到，Markdown“基于电子邮件和新闻组的格式约定，是一种用于编写结构化文档的纯文本格式”（CommonMark，未注明日期.）。

source: Those fault lines are still threatening the field's foundation, and even prompted Carolyn Rude to pose the rhetorical question, “In trying to define our field as something more than adjunct to the computer industry engaged in vocational training, have we overcorrected?” (2015, p.
zh_cn: 这些断层线仍然威胁着技术传播领域的根基，甚至迫使卡罗琳·路德提反问到：“认为技术传播致力于职业培训，试图将技术传播定义为仅比计算机产业的附属物略微高级的领域，这是否矫枉过正了？”(2015, p.

source: Thus, an MDITA paragraph does not require any tags, as seen in Figure 6.16.
zh_cn: 因此，在 MDITA 中使用段落组件不需要任何标签，如图6.16所示。

source: Users perceive lower cost, lower complexity at the range of use they expect, and can move up as requirements dictate (basically playing to progression of needs and investments in the DITA Maturity Model).
zh_cn: 用户在他们预期的使用范围内，感知到更低的成本和复杂度，并且可以根据需求相应提高（基本上取决于对 DITA 成熟度模型的需求大小和投资程度）。

source: Actually, the all- inclusive edition of the DITA 1.3 standard has 26 document types (predefined document, or even genre, templates) and 621 element types (placeholders or structures for specific content moves).
zh_cn: 实际上，DITA 1.3标准的完整版本包含26种文档类型（预定义文档、类型或模板）和621种元素类型（用于特定内容操作的占位符或结构）。

source: Chapters 5 and 6 include separate sections for each authoring format; nevertheless, any LwDITA map can reference any LwDITA topic regardless of authoring format.
zh_cn: 第5 章和第6章会单独介绍每种写作格式，不过无论选择何种编写格式， LwDITA 地图都可以引用。

source: Figure 5.13 shows a version of the brochure map created in MDITA.
zh_cn: 图5.13 展示了用于创建宣传手册的 MDITA 格式地图。

source: The “essays from whole cloth” reference is a nod to the book-oriented kind of writing using a word processor that most academic programs in technical communication and content development teach as standard practice.
zh_cn: “完整性文章”这个描述是对以书籍为导向、以文字处理器为工具的写作方式的一种认可，大多数技术传播和内容开发的学术项目都将其作为标准实践来教授。

source: Lorena Barba has stronger doubts about the ambitious benefits of Wing's computational thinking.
zh_cn: 洛雷娜·巴尔巴对温提出的计算机思维所带来的巨大好处持更强烈的怀疑态度。

source: Figure 6.8 shows the franchise introduction topic with a title and a heading 1.
zh_cn: 图6.8展示了一个介绍特许经营权的话题，该话题包含标题元素和一级标题元素。

source: Figure 5.1 shows the recipe critiques DITA map, which you can save as marinara-critique.ditamap.
zh_cn: 图5.1即为菜谱评价网站的 DITA 地图，你可以将其保存为 marinara- reviews .ditamap。

source: In May of 2014, Priestley presented the XDITA/HDITA proposal in a webinar titled “Does DITA Need XML?” That month, he also submitted a formal proposal to the DITA Technical Committee asking for the creation of a dedicated Lightweight DITA subcommittee.
zh_cn: 2014年5月，普里斯特利在一个名为“DITA 需要 XML吗?”的网络研讨会上提出了 XDITA/HDITA 的提案。同月，他还向 DITA 技术委员会提交了一份正式提案，要求创建一个专门的轻量级DITA小组委员会。

source: Nonetheless, thinking in and planning abstractions are really the everyday tasks of technical authors in an intelligent content environment.
zh_cn: 尽管如此，在智能内容环境中思考和规划抽象实际上是技术作者的日常任务。

source: This deficiency presents a unique opportunity for implementing an approach based on principles of computational thinking.
zh_cn: 这个不足为实现基于计算思维原则的方法提供了一个不可多得的机会。

source: You can download these code samples from the Creating Intelligent Content with Lightweight DITA GitHub repository (https://github.com/carlosevia/lwdita-book).
zh_cn: 你可以从 Creating Intelligent Content with Lightweight DITA Github 仓库中（https://github.com/carlosevia/lwdita-book）下载这些代码示例。

source: It is also behind the predetermined content types (e.g. concept, task, and reference) in the DITA standard.
zh_cn: DITA标准中预定的内容类型(例如概念、任务和参考)的背后也同样是这种痴迷。

source: 156) and argued that “technical communicators should be able to write, edit, and manage XML documentation, including XML tags, document type definitions (DTDs), XML schemas, and Darwin Information Typing Architecture (DITA)” (Gesteland McShane, 2009, p.
zh_cn: 156页），并认为“技术传播工程师应该具备编写、编辑和管理XML文档的能力，这包括 XML 标记，文档类型定义（DTD）,，XML 体系结构和 DITA”（杰斯特兰德·麦柯肖恩，2009年， 第

source: This kind of writing is the basis of several technical communication and intelligent content practices and techniques, including component content management systems (CCMS), which are “a centralized system that helps organizations capture, manage, store, preserve, and deliver topic-based content (components)” (Kerzreho, 2016 p.
zh_cn: 这种写作类型是几种技术传播和智能内容实践和技术的基础，包括组件内容管理系统（CCMS），CCMS 是“一个集中化系统，可以帮助组织获取、管理、存储、维护、发布基于主题的内容（组件）”（科兹热霍， 2016年，第

source: Content in XML, for example, can be tagged as a product name, a procedure, a works cited entry, or any other part of a technical or professional document.
zh_cn: 例如，XML中 的内容可以标记为一个产品名称、一个步骤、一个作品引用条目，或技术或专业文档的任何一部分。

source: 60), and single sourcing, which can be defined as the practice of “creating content once, planning for its reuse in multiple places, contexts, and output channels” (White, 2016 p.
zh_cn: 60页），还包括同源开发，同源开发是“只创建一次内容，就考虑到在多个地方、多个语境、多种输出渠道中复用内容”的实践 (White, 2016 p.

source: 16) (Figure 1.2).
zh_cn: 16页）（图1.2）。

source: 33), and that it is more about conceptualizing than programming.
zh_cn: 33)，比起编程化，它更关注的是概念化。

source: Existing tools can provide UI masking of features that can be enabled later on (license upgrade, etc.)
zh_cn: 现有的工具可以为以后启用的特性提供 UI 界面（通过授权升级等）。

source: Figure 4.2 shows a file that reproduces the list items from Figure 4.1 in valid HTML5 syntax.
zh_cn: 图4.2 展现了从图4.1 中有效的HTML5语法下的列表项复用至XML文件。

source: Figure 6.22 shows an unordered, or bulleted, list with features of the Sensei Sushi franchise in an XDITA topic.
zh_cn: 图6.22展示了一个 XDITA 话题中的无序列表，或者说项目符号列表，该列表包含了 Sensei Sushi 特许经营权的各项特性。

source: In DITA 1.3, for example, a list item can have mixed content (e.g., child elements like a paragraph combined with non-whitespace character data like text).
zh_cn: 例如在DITA 1.3中，列表项可以有混合内容（像段落这样的子元素和文本这样的非空白字符数据组合在一起）。

source: In Wing's model, however, computing abstractions go beyond numerical abstractions and cover symbolic, algorithmic, and representational abstractions (Wing, 2008).
zh_cn: 然而，在温的模型中，计算机思维的抽象概念超越了数字抽象，涵盖了符号抽象、算法抽象和具象抽象 (Wing, 2008)。

source: In a blog post titled “Overview of Lightweight DITA (XDITA and HDITA),” Michael Priestley introduced an idea to liberate the DITA standard from its longstanding dependence on the Extensible Markup Language (XML).
zh_cn: 在一篇题为《轻量级DITA（XDITA 和 HDITA）概述》（Overview of Lightweight DITA （XDITA and HDITA））的博客文章中，迈克尔·普里斯特利介绍了这样一种想法：长期以来 DITA 标准一直依赖可扩展标记语言 (XML) ，需要将其解放出来。

source: The generic topic is the only document type available for creating content in the initial release of the LwDITA specification.
zh_cn: 在LwDITA规范最初的版本中，通用话题是用于创建内容的惟一文档类型。

source: This highly structured task topic reads like a smoothie that came out of a blender combining generic, organizational, and disciplinary conventions and commonplaces from Carroll, Price, and Hargis and her co-authors, and others who attempted to capture the essence of technical documentation.
zh_cn: 这个高度结构化的任务主题更像是一个融合产物，融合了通用型、组织架构型、和规范型惯例，以及卡罗尔、哈吉斯及合著者以及其他想要抓住技术文档本质的人的常规做法。

source: This is a long process of evolution that started in 2012.
zh_cn: 这是一个始于2012年的漫长演进过程。

source: a WordPress plugin for HDITA or a GitHub-based MDITA processor for GitHub Pages?).
zh_cn: 是HDITA的WordPress插件，还是GitHub页面基于GitHub的MDITA处理器?

source: the manuals didn't work.
zh_cn: 手册起不到作用。

source: 8), and can be defined as “small independent piece of information on a single subject” (Baker, 2013, p.
zh_cn: 8页），话题也可以理解为“关于某个主题的短小独立的信息片段”（贝克，2013年，第

source: Andersen adds that this type of content supported by topic-based information design “has been given various names, including intelligent content, nimble content, smart content, portable content, and future-ready content.” Rockley, Cooper, and Abel describe intelligent content as “designed to be modular, structured, reusable, format free, and semantically rich and, as a consequence, discoverable, reconfigurable, and adaptable” (Rockley et al., 2015, p.
zh_cn: 安德森补充说，这种基于主题信息设计的内容类型 “已经有了各种叫法，包括智慧内容、敏捷内容、智能内容、可移植内容和面向未来的内容。”罗克利（Rockley）、库珀（Cooper）和亚伯（Abel）认为智能内容是“甫一设计就是模块化、结构化、可重用、格式自由、语义丰富的，因此它们也具备可发现、可重构和可修改的特质”(Rockley et al., 2015, p.

source: Carroll used the term to describe approaches to self-instruction related to computing that expected that a user would consume content at their own pace and then come out competent, after returning to “varying levels of incompetence” (p.
zh_cn: 卡罗尔使用这一术语来描述与计算机相关的自学方法，希望藉由这些方法使得用户能以自己的节奏学习相关内容，并获得相应技能，因为用户使用特定硬件或软件系统的能力水平不一。(p.

source: Embracing the six content types of Information Mapping, the Lightweight DITA prototype wrapped up 2012 with a total of 12 potential content types and the many tags or generic conventions associated with them.
zh_cn: 2012年末，包括信息映射的六种内容类型在内，轻量级DITA原型总共包含了 12种潜在的内容类型以及许多与其相关的标签或通用规则。

source: Everybody likes standards, laws, and sausage, said Veen, but nobody wants to know how they are made.
zh_cn: 维恩说，人人都喜欢标准、法律和香肠，但没人想知道它们是如何制作的。

source: Figure 5.11 shows a simple web view of the HDITA map, without any content processing or formatting, as seen on a browser.
zh_cn: 图5.11展示了由 HDITA 地图生成的简单网页，没有做任何内容处理，也没有添加额外的格式，就像在浏览器上看到的那样。

source: I argue that if technical communicators are trained with principles of rhetorical problem solving and computational thinking, they can work in lightweight environments without the need of a robust XML solution.
zh_cn: 我认为，如果技术传播人员受过计算机思维的训练，知晓解决修辞问题的原则，他们就可以在轻量级 DITA 的环境中工作，而无需使用健壮的 XML 解决方案。

source: I insisted on the potential consequences of losing the flagship genre of technical communication, and Carroll painted a bigger picture: “It's not just the manual, but the world has changed, and the software and documentation business model.
zh_cn: 我坚称丢弃技术传播的标志性体裁将导致一系列潜在的后果，但卡罗尔描绘了一幅更为宏伟的蓝图：“不只是手册发生了变化，而是世界变了，软件和文档商业模式都改变了。

source: In this introductory chapter I will only present the results of transformations using the DITA-OT, but in Chapter 5 I will focus on specific steps for conducting those transformations.
zh_cn: 在介绍性的第一章中，我将只展示使用 DITA-OT 转换生成的输出物，不过在第5章中，我会重点介绍进行转换所需的具体操作步骤。

source: In Chapter 1 I included some examples of DITA maps and promised that I will show you how to process them with DITA-aware tools and generate end user documents.
zh_cn: 在第1章中，我提供了一些 DITA 地图示例，并承诺将向你展示如何使用 DITA 的相关工具处理它们并生成最终用户文档。现。

source: O'Keefe's extended definition includes the following features of XML:
zh_cn: 奥基夫的扩展定义包括以下 XML 特性：

source: Priestley's original proposal responded to complaints about the “many tags” included in the standard, but a non-XML version of DITA was not yet a part of those early conversations.
zh_cn: 普里斯特利最初的提议是为了回应人们对标准中包含“标签太多”的抱怨，但非XML版DITA还没有出现在早期讨论之列。

source: Rhetorically effective content can connect topical and authorial intentions with user responses regardless of a deliverable's format or context.
zh_cn: 而有着良好修辞效果的内容可以将话题和作者的意图与用户的反馈联系起来，无需考虑内容的格式或上下文。

source: She presented headings, lists, and tables as examples of those elements, indicating that whereas in works of
zh_cn: 她将标题、列表和表格作为元素的示例，

source: Studies about rhetorical conventions in technical and professional communication genres have not disappeared, as Kim Sydow Campbell and Jefrey S. Naidoo showed on their study of structural moves in marketing white papers (Campbell & Naidoo, 2017).
zh_cn: 金·西多·坎贝尔和杰弗雷·奈杜在研究市场营销白皮书中的结构文步时指出，对专业技术传播体裁中修辞惯例的研究并未消失。 (Campbell & Naidoo, 2017).

source: The guidelines presented in DQTI, Hargis claimed, were “brief directives about what to do or not to achieve the characteristics of quality.
zh_cn: 哈吉斯称， DQTI中展现的指导方针是“关于如何实现质量特性的简要指示”。

source: The recorded minutes show that the following individuals were in attendance: Mark Giffin, Tim Grantham, Stan Doherty, Kris Eberlein, Tom Comerford, Chris Nitchie, Mark Poston, Adrian Warman, Michael Priestley, Don Day, and Joe Pairman.
zh_cn: 会议记录显示马克·吉芬，蒂姆·格兰瑟姆，斯坦·多尔蒂，克里斯·埃伯莱因，汤姆·科默福德，克里斯·尼奇，马克·波斯顿，阿德里安·沃曼，迈克尔·普里斯特利，唐·戴和乔·佩尔曼出席了会议。

source: The technical specification for the DITA standard defines topic as follows:
zh_cn: DITA标准的技术规范对主题的定义如下:

source: The web deliverable that Chef Pedro needs for this project should include the following sections:
zh_cn: 对于这个项目佩德罗所需要的网页交付内容应该包括以下部分：

source: Therefore, those are the only content types present in the base edition.
zh_cn: 因此，这些是基本版本中仅有的内容类型。

source: These models go beyond traditional document-based lifecycles (which are more production- oriented) associated with technical communication practices that work mainly as straightforward maps in a line of progression.
zh_cn: 这些模型超越了传统的基于文档的生命周期（传统的生命周期更多地面向生产），基于文档的生命周期与在技术传播演进过程中具有指向作用的实践活动息息相关。

source: These professionals work in environments that depend on the separation of content in concept, task, reference, and other types.
zh_cn: 这些专业人员工作的环境依赖于概念（concept）、任务（task）、引用（reference）和其他类型的内容分离。

source: Through an online introduction by Michael Priestley, I received the following reply from Carpenter:
zh_cn: 迈克尔·普里斯特利在线上介绍我和卡朋特认识，以下是我从他那里收到的回复：

source: Thus, in HDITA the definition list environment looks as shown in Figure 6.18.
zh_cn: 因此，在 HDITA 中，定义列表组件如图6.18所示。

source: Using that toolkit, known as the DITA Open Toolkit (OT), or a software tool that uses the Open Toolkit, Chef Pedro can produce quick information deliverables.
zh_cn: 使用该工具包，即 DITA Open toolkit （OT）或使用基于 Open Toolkit 开发的软件工具，佩德罗可以快速生成可交付信息。

source: all that kind of object-oriented thinking that was being applied to text in a pretty interesting analogy.
zh_cn: 讲面向对象的思维运用到文本中，确实是很有意思的类比。

source: 2) and in the most recent edition is presented as: “In the context of a product, a focus on helping users do tasks that support their goals” (Carey et al., 2014, p.
zh_cn: 2) 在最新版本中是这样描述的:“在产品的环境中，关注于帮助用户完成支持他们目标的任务”(Carey et al., 2014, p.

source: 9) and it should advise the user “that this is all he needs to know about the subject unless he wants to become a computer programmer, in which case he should read some other book”(1976, pp.
zh_cn: 9) 它还应该建议用户“关于这个主题，他所需要知道的全部都在这了，除非他想成为一个计算机程序员，那他应该读一些其他的书”(1976, pp.

source: Actually, the OASIS email list archives mention a DITA “profile for modest needs” that sounds similar to Lightweight DITA on a message sent by Don Day (member of the original DITA development team at IBM), who then chaired the DITA Technical Committee, on April 4, 2011.
zh_cn: 实际上，OASIS 电子邮件存档中记录了一条信息，里面写着“用于简单需求的 DITA 概述”，这很像轻量级 DITA 的概念。这条信息发于2011年4月4日，来自唐·戴（最初 IBM DITA 开发团队的成员）， 唐·戴当时是 DITA 技术委员会的主席。

source: As she traced the use of evolutionary language when describing genre use in literature, architecture, music, and painting, Miller attributed this appropriation of language from biological sciences to an “obsession with order and rules” (2015, p.
zh_cn: 当她描述文学、建筑、音乐和绘画中的体裁的使用时，她追踪了演进性语言的使用，米勒将这种将生物科学中术语挪为他用的现象归结为“对秩序和规则的痴迷”。 (2015, p.

source: Figure 5.12 shows the DITA-OT command for processing an HDITA map and producing a PDF deliverable, which looks very similar to the one used for the XDITA map transformation.
zh_cn: 图5.12展示了利用 DITA-OT 转换 HDITA 格式的地图，并生成 PDF 交付文件所需输入的命令，它与转换 XDITA 格式的地图所需的命令非常相似。

source: Figure 6.11 shows a short description in the introductory XDITA topic for the Sensei Sushi franchise brochure.
zh_cn: 图6.11展示了用 XDITA 编写的介绍 Sensei Sushi 特许经营权的话题，其中包含简短描述组件。

source: In Rigo's outline, “each statement, command, option, parameter, or similar independent item” requires the name of the statement or command, a paragraph describing its function, a formal definition using the documentation conventions stated in the Introduction, examples of valid commands/statements, summary of rules, and additional examples as needed.
zh_cn: 里戈的大纲中，“所有语句、命令、参数或类似的独立项”需要标明语句或命令的名称、一段介绍其功能的内容、使用简介中的文档惯例下正式定义、有效命令/语句的示例、规则的总结，以及需要的其他示例。

source: In many technical communication practices, “efficient content reuse does not involve copy-and-pasting; instead it uses transclusion, whereby content is authored in one location and used by reference in other locations” (Eberlein, 2016 p.
zh_cn: 在许多技术传播实践中，“有效内容的重用不是复制粘贴，而是引用，即在一个地方创作内容，在其他地方引用该内容”（埃伯莱因，2016年， 第

source: In using terminology from evolution to describe how genres change (or evolve) in society, Miller does not “want to be understood as suggesting that our understanding of cultural change must borrow from biology.
zh_cn: 在使用关于进化的术语来描述社会中体裁如何演化（或进化）时，米勒并不想“被理解为这是在提倡对文化变革的理解必须借鉴生物学的概念。

source: Johnson-Eilola adds that a “paradigmatic example of this skill can be found in one of the most common tasks in software documentation: rethinking a series of system commands so that it coincides with a user's task representation and context” (1996, p.
zh_cn: 约翰逊·艾劳拉补充说，“这种技能的典型例子体现在编写软件文档时最常见的任务之一中：重新思考一系列系统命令，使它们与用户的任务表示和所处上下文一致” (1996, p.

source: The topic includes some HDITA snippets taken from Priestley's introductory blog post, which created a sense of structure for generic moves in the Markdown syntax.
zh_cn: 这个话题包含了一些从普里斯特利的介绍性博文中摘取的 HDITA 片段，这些片段为 Markdown 语法中的通用功能创造了一种结构感。

source: Then, it warned readers about the pitfalls of implementing a custom XML solution or adopting a standard: “In other words, when you create a new markup language (using XML to define its markup and rules), you shut yourself off from interchange with the rest of the world; when you adopt a standard markup language, you lose the benefits promised by content-specific markup” (2001, p.
zh_cn: 然后，它警告读者采用自定义XML解决方案或标准的缺陷:“换句话说，当您创建一种新的标记语言(使用XML定义其标记和规则)时，你也就隔绝了与周遭世界的交流；当采用标准标记语言时，就失去了特定内容标记所带来的好处。 (2001, p.

source: Academic discussion related to the implementation and innovation of intelligent content has been slow, as evidenced by the titles and abstracts of presentations and publications from 2012 to 2018 in relevant conferences and journals, respectively.
zh_cn: 从2012 年至 2018 年相关会议和期刊上发表的演讲和出版物的标题和摘要可以看出，与推进和创新智能相关的学术讨论进展缓慢。

source: Additionally, the website Learning DITA2 from Scriptorium is a free and solid resource for novice-to-advanced users who need to learn about DITA and its content structuring and publishing capabilities.
zh_cn: 此外，Scriptorium上的学习DITA2网站是一个免费且可靠的资源，从新手到高阶用户都可以从中了解DITA及其内容结构和发布能力。

source: At the OASIS DITA Technical Committee, the standard continually evolves with the purpose “to define and maintain the Darwin Information Typing Architecture (DITA) and to promote the use of the architecture for creating standard information types and domain-specific markup vocabularies” (OASIS Darwin Information Typing Architecture TC, n.d.).
zh_cn: 在 OASIS DITA 技术委员会的推进下，DITA 不断发展，OASIS 致力于“定义和维护达尔文信息类型体系结构（DITA），并提倡使用该体系结构创建标准信息类型和特定领域的标记词汇表”。（OASIS DITA技术委员会，未注明日期）。

source: Figure 6.20 includes an ordered list in XDITA giving steps that a potential investor should go through to obtain the franchise license.
zh_cn: 图6.20展示了 XDITA 中的一个有序列表，该列表描述了潜在投资者购买特许经营权许可证的步骤。

source: Following their model, the rhetorical conventions of a technical manual presented by Cohen and Cunningham can be described as generic - they were specific to a genre (the technical manual).
zh_cn: 根据他们的模型，柯亨和坎宁安提出的技术手册的修辞惯例可以说是通用的- 它们适用于特定体裁（技术手册）。

source: For any case that requires stricter structured models, the DITA standard will be there as an alternative or a next-level solution.
zh_cn: 对于需要更严密的结构化模型的情况，DITA 标准可以作为替代方案或下一级解决方案。

source: I see the blending of computational thinking and writing studies discussed in this chapter as a way to patch that fault line and find ways to teach computing principles in our domain without losing our academic and disciplinary identities.
zh_cn: 我认为将本章中讨论的计算机思维和写作研究结合起来是一种修补断层线的方法，也有助于在不丢失学术和专业身份的情况下，找到在技术传播领域教授计算机原理的对策。
